Catalogs/УчебныеПериоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>УчебныеПериоды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Классы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Классы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УчебныеПериоды/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если (ЗначениеЗаполнено(ДатаНачала) Или ЗначениеЗаполнено(ДатаОкончания)) И ДатаНачала > ДатаОкончания Тогда
		Отказ = Истина;
	Иначе
		Классы.Свернуть("Класс");
		Предметы.Свернуть("Предмет");
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Наименование	= ОбъектКопирования.Наименование;
	Если ЗначениеЗаполнено(ОбъектКопирования.ДатаОкончания) Тогда
		ДатаОкончания = ДобавитьМесяц(ОбъектКопирования.ДатаОкончания, 12);
		Если Найти(Наименование, Формат(ОбъектКопирования.ДатаОкончания, "ДФ=yyyy")) > 0 Тогда
			Наименование = СтрЗаменить(Наименование, Формат(ОбъектКопирования.ДатаОкончания, "ДФ=yyyy"), Формат(ДатаОкончания, "ДФ=yyyy"));
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектКопирования.ДатаНачала) Тогда
		ДатаНачала = ДобавитьМесяц(ОбъектКопирования.ДатаНачала, 12);
		Если Найти(Наименование, Формат(ОбъектКопирования.ДатаНачала, "ДФ=yyyy")) > 0 Тогда
			Наименование = СтрЗаменить(Наименование, Формат(ОбъектКопирования.ДатаНачала, "ДФ=yyyy"), Формат(ДатаНачала, "ДФ=yyyy"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
